app/Controllers/Pembayaran.php

SELECT *
FROM `pemesanan`
---
    public function index()
    {
         $login = $this->checkLogin();
        if ($login) return $login;

        $timeout = $this->autoSessionTimeout();
        if ($timeout) return $timeout;

        $data['pembayaran'] = $this->pembayaranModel->getPembayaranWithPemesanan();
        $data['pemesanan'] = $this->pemesananModel->findAll();

INSERT INTO `pembayaran` (`id_pemesanan`, `tanggal_bayar`, `jumlah_bayar`, `metode_bayar`) VALUES ('2', '2025-12-24', '330000', 'Qris')
---
    public function save()
    {
        $id = $this->request->getPost('id');

        $data = [
            'id_pemesanan'  => $this->request->getPost('id_pemesanan'),
            'tanggal_bayar' => $this->request->getPost('tanggal_bayar'),
            'jumlah_bayar'  => $this->request->getPost('jumlah_bayar'),
            'metode_bayar'  => $this->request->getPost('metode_bayar')
        ];

        if ($id) {
            $this->pembayaranModel->update($id, $data);
            log_update('Pembayaran', $id);
            session()->setFlashdata('success', 'Data pembayaran berhasil diperbarui.');
        } else {
            $insertId = $this->pembayaranModel->insert($data);