app/Controllers/Pemesanan.php

SELECT *
FROM `penyewa`
---
    public function index()
    {
        // Jika penyewa login -> normal
        $session = session();
        $idPenyewa = $session->get('id_penyewa');

        $data = [ 'paket_bus' => $this->pemesananModel->getPaketLengkap(), 'isAdmin' => false, 'penyewa_list' => [] ];

        if (!empty($idPenyewa)) {
            // pengguna penyewa
            return view('/pemesanan/form_pemesanan', $data);
        }

        // Cek apakah user adalah karyawan/admin (boleh memesan atas nama penyewa)
        $userSource = $session->get('userSource');
        $userData = $session->get('userData') ?? [];
        if ($userSource === 'karyawan' && isset($userData['idjabatan']) && (int)$userData['idjabatan'] === 1) {
            $data['isAdmin'] = true;
            $data['penyewa_list'] = $this->penyewaModel->findAll();

SELECT *
FROM `penyewa`
WHERE `penyewa`.`id` = 2
---

            if ($userSource === 'karyawan' && isset($userData['idjabatan']) && (int)$userData['idjabatan'] === 1 && !empty($postedPenyewa)) {
                // Validasi penyewa yang dipilih admin
                $foundPenyewa = $this->penyewaModel->find((int)$postedPenyewa);

INSERT INTO `pemesanan` (`tanggal_pesan`, `id_penyewa`, `id_paketbus`, `total_bayar`) VALUES ('2025-12-23', 2, '2', 150000)
---
        // Gunakan transaksi pada koneksi model untuk konsistensi
        $db = $this->pemesananModel->db;
        $db->transStart();
        $simpan = $this->pemesananModel->save($payload);