app/Models/PembayaranModel.php

SELECT `pembayaran`.*, `pemesanan`.`tanggal_pesan`, `pemesanan`.`total_bayar`, `penyewa`.`nama_penyewa`
FROM `pembayaran`
LEFT JOIN `pemesanan` ON `pemesanan`.`id` = `pembayaran`.`id_pemesanan`
LEFT JOIN `penyewa` ON `penyewa`.`id` = `pemesanan`.`id_penyewa`
---
    public function getPembayaranWithPemesanan()
    {
        return $this->select('
                    pembayaran.*,
                    pemesanan.tanggal_pesan,
                    pemesanan.total_bayar,
                    penyewa.nama_penyewa
                ')
                ->join('pemesanan', 'pemesanan.id = pembayaran.id_pemesanan', 'left')
                ->join('penyewa', 'penyewa.id = pemesanan.id_penyewa', 'left')
                ->findAll();