app/Models/PemesananModel.php

    public function getPaketLengkap()
    {
        return $this->db->table('paket_bus pb')
            ->select('pb.id as id_paketbus, pw.nama_paket, pw.tujuan, pw.harga')
            ->join('paket_wisata pw', 'pw.id = pb.id_paketwisata')
            ->get()
            ->getResultArray();
---
SELECT `pb`.`id` as `id_paketbus`, `pw`.`nama_paket`, `pw`.`tujuan`, `pw`.`harga`
FROM `paket_bus` `pb`
JOIN `paket_wisata` `pw` ON `pw`.`id` = `pb`.`id_paketwisata`

    public function getHargaPaket($idPaketBus)
    {
        return $this->db->table('paket_bus pb')
            ->join('paket_wisata pw', 'pw.id = pb.id_paketwisata')
            ->where('pb.id', $idPaketBus)
            ->get()->getRow();
---
SELECT *
FROM `paket_bus` `pb`
JOIN `paket_wisata` `pw` ON `pw`.`id` = `pb`.`id_paketwisata`
WHERE `pb`.`id` = '2'

    public function cekKetersediaan($id_paketbus, $tgl_berangkat, $tgl_kembali)
    {
        return $this->db->table('pemesanan_detail pd')
            ->join('pemesanan p', 'p.id = pd.id_pemesanan')
            ->where('p.id_paketbus', $id_paketbus)
            ->groupStart()
                ->where('pd.tanggal_berangkat <=', $tgl_kembali)
                ->where('pd.tanggal_kembali >=', $tgl_berangkat)
            ->groupEnd()
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `pemesanan_detail` `pd`
JOIN `pemesanan` `p` ON `p`.`id` = `pd`.`id_pemesanan`
WHERE `p`.`id_paketbus` = '2'
AND   (
`pd`.`tanggal_berangkat` <= '2025-12-23'
AND `pd`.`tanggal_kembali` >= '2025-12-23'
 )

    public function simpanDetail($data)
    {
        return $this->db->table('pemesanan_detail')->insert($data);
---
INSERT INTO `pemesanan_detail` (`id_pemesanan`, `tanggal_berangkat`, `tanggal_kembali`, `jumlah_penumpang`) VALUES (30, '2025-12-23', '2025-12-23', '1')

    public function getSemuaPemesanan()
    {
        return $this->db->table('pemesanan p')
            ->select('p.*, pd.tanggal_berangkat, pd.tanggal_kembali, pd.jumlah_penumpang, pw.nama_paket, pw.tujuan, pen.nama_penyewa, pay.id as id_pembayaran')
            ->join('pemesanan_detail pd', 'pd.id_pemesanan = p.id')
            ->join('paket_bus pb', 'pb.id = p.id_paketbus')
            ->join('paket_wisata pw', 'pw.id = pb.id_paketwisata')
            ->join('penyewa pen', 'pen.id = p.id_penyewa')
            ->join('pembayaran pay', 'pay.id_pemesanan = p.id', 'left')
            ->orderBy('p.id', 'DESC')
            ->get()->getResultArray();
---
SELECT `p`.*, `pd`.`tanggal_berangkat`, `pd`.`tanggal_kembali`, `pd`.`jumlah_penumpang`, `pw`.`nama_paket`, `pw`.`tujuan`, `pen`.`nama_penyewa`, `pay`.`id` as `id_pembayaran`
FROM `pemesanan` `p`
JOIN `pemesanan_detail` `pd` ON `pd`.`id_pemesanan` = `p`.`id`
JOIN `paket_bus` `pb` ON `pb`.`id` = `p`.`id_paketbus`
JOIN `paket_wisata` `pw` ON `pw`.`id` = `pb`.`id_paketwisata`
JOIN `penyewa` `pen` ON `pen`.`id` = `p`.`id_penyewa`
LEFT JOIN `pembayaran` `pay` ON `pay`.`id_pemesanan` = `p`.`id`
ORDER BY `p`.`id` DESC

    public function hapusPemesanan($id)
    {
        $this->db->transStart();

        // 1. Hapus di tabel detail terlebih dahulu (foreign key)
        $this->db->table('pemesanan_detail')->where('id_pemesanan', $id)->delete();

        // 2. Hapus di tabel pembayaran jika ada
        $this->db->table('pembayaran')->where('id_pemesanan', $id)->delete();

        // 3. Hapus data utama di tabel pemesanan
        $this->db->table('pemesanan')->where('id', $id)->delete();
---
DELETE FROM `pemesanan_detail`
WHERE `id_pemesanan` = '30'
DELETE FROM `pembayaran`
WHERE `id_pemesanan` = '30'
DELETE FROM `pemesanan`
WHERE `id` = '30'